#include <stdio.h>
#include <string.h>
#include <stdlib.h>
#include <time.h>



#define CARD_DECK 49
#define WONDERS 7
#define RED "\x1B[31m"
#define GRN "\x1B[32m"
#define YEL "\x1B[33m"
#define BLU "\x1B[34m"
#define MAG "\x1B[35m"
#define CYN "\x1B[36m"
#define WHT "\x1B[37m"
#define RESET "\x1B[0m"

struct cost{
    int coins;
    int wood;
    int stone;
    int clay;
    int ore;
    int glass;
    int papyrus;
    int cloth;
};

struct benefic{
    int coins;//1
    int wood;//2
    int stone;//3
    int clay;//4
    int ore;//5
    int glass;//6
    int papyrus;//7
    int cloth;//8
    int shield;//9
    int neighbourLeft;//10
    int neighbourRight;//11
    int victoryPoints;//12
    int mechanicalWheel;//13
    int math;//14
    int literature;//15
};

struct benefical{
    int coins;//1
    int wood;//2
    int stone;//3
    int clay;//4
    int ore;//5
    int glass;//6
    int papyrus;//7
    int cloth;//8
    int shield;//9
    int victoryPoints;//12
    int mechanicalWheel;//13
    int math;//14
    int literature;//15
};


struct wonder{
    char name[101];
    struct cost CStages[3];
    struct benefical BStages[3];
    struct benefical startingItem;
    unsigned int used;
};

struct card{
    char name[50];
    unsigned int type; //0-brown, 1-blue, 2-yellow,  3-Red, 4- Green, 5- Gray
    struct cost cardCost;
    struct benefic getRich; // you will have those things
    unsigned int used;
};

struct items{
     int wood;
     int stone;
     int clay;
     int ore;
     int glass;
     int papyrus;
     int cloth;
     int math;
     int mechanicalWheel;
     int literature;
};

typedef struct items Items;

struct profil{
    char nickname[101];
    unsigned int points;
    unsigned int noOfShields;
    unsigned int coins;
    struct wonder myWonder;
    struct card myDeck[7];
    unsigned int before;
    unsigned int after;
    unsigned int noOfCards;
    struct card brown[7];
    unsigned int brown1;
